HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_regdef.h
/**
 * \file IfxSdma_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Sdma Sdma
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Sdma_Bitfields Bitfields
 * \ingroup IfxLld_Sdma
 * 
 * \defgroup IfxLld_Sdma_union Union
 * \ingroup IfxLld_Sdma
 * 
 * \defgroup IfxLld_Sdma_struct Struct
 * \ingroup IfxLld_Sdma
 * 
 */
#ifndef IFXSDMA_REGDEF_H
#define IFXSDMA_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Sdma_Bitfields
 * \{  */

/** \\brief  SDMA Sub-block Access Enable Register 0 */
typedef struct _Ifx_SDMA_BLK_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_SDMA_BLK_ACCEN0_Bits;

/** \\brief  SDMA Sub-block Access Enable Register 1 */
typedef struct _Ifx_SDMA_BLK_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_ACCEN1_Bits;

/** \\brief  SDMA Channel Address Control Register */
typedef struct _Ifx_SDMA_BLK_CH_ADRCR_Bits
{
    unsigned int SMF:3;                     /**< \brief [2:0] Source Address Modification Factor (rw) */
    unsigned int INCS:1;                    /**< \brief [3:3] Increment of Source Address (rw) */
    unsigned int DMF:3;                     /**< \brief [6:4] Destination Address Modification Factor (rw) */
    unsigned int INCD:1;                    /**< \brief [7:7] Increment of Destination Address (rw) */
    unsigned int CBLS:4;                    /**< \brief [11:8] Circular Buffer Length Source (rw) */
    unsigned int CBLD:4;                    /**< \brief [15:12] Circular Buffer Length Destination (rw) */
    unsigned int SHCT:2;                    /**< \brief [17:16] Shadow Control (rw) */
    unsigned int SHWEN:1;                   /**< \brief [18:18] Shadow Address Register Write Enable (rw) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_CH_ADRCR_Bits;

/** \\brief  SDMA Channel Control Register */
typedef struct _Ifx_SDMA_BLK_CH_CHCR_Bits
{
    unsigned int TREL:14;                   /**< \brief [13:0] Transfer Reload Value (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int BLKM:3;                    /**< \brief [18:16] Block Mode (rw) */
    unsigned int RROAT:1;                   /**< \brief [19:19] Reset Request Only After Transaction (rw) */
    unsigned int CHMODE:1;                  /**< \brief [20:20] Channel Operation Mode (rw) */
    unsigned int CHDW:2;                    /**< \brief [22:21] Channel Data Width (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int PATSEL:2;                  /**< \brief [25:24] Pattern Select (rw) */
    unsigned int ECH:1;                     /**< \brief [26:26] Enable Hardware Transfer Request (w) */
    unsigned int DCH:1;                     /**< \brief [27:27] Disable Hardware Transfer Request (w) */
    unsigned int PRSEL:1;                   /**< \brief [28:28] Peripheral Request Select (rw) */
    unsigned int SCH:1;                     /**< \brief [29:29] Set Transaction Request for DMA Channel z (w) */
    unsigned int DMAPRIO:2;                 /**< \brief [31:30] DMA Priority (rw) */
} Ifx_SDMA_BLK_CH_CHCR_Bits;

/** \\brief  SDMA Channel Interrupt Control Register */
typedef struct _Ifx_SDMA_BLK_CH_CHICR_Bits
{
    unsigned int WRPSE:1;                   /**< \brief [0:0] Wrap Source Enable (rw) */
    unsigned int WRPDE:1;                   /**< \brief [1:1] Wrap Destination Enable (rw) */
    unsigned int INTCT:2;                   /**< \brief [3:2] Interrupt Control (rw) */
    unsigned int ETRL:1;                    /**< \brief [4:4] Enable Transaction Request Lost Interrupt (rw) */
    unsigned int reserved_5:7;              /**< \brief \internal Reserved */
    unsigned int IRDV:4;                    /**< \brief [15:12] Interrupt Raise Detect Value (rw) */
    unsigned int CWRP:1;                    /**< \brief [16:16] Clear Wrap Buffer Interrupt xz (w) */
    unsigned int reserved_17:1;             /**< \brief \internal Reserved */
    unsigned int CICH:1;                    /**< \brief [18:18] Clear Interrupt for DMA Channel xz (w) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int CTL:1;                     /**< \brief [20:20] Clear Transaction Request Lost for DMA Channel xz (w) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_CH_CHICR_Bits;

/** \\brief  SDMA Channel Status Register */
typedef struct _Ifx_SDMA_BLK_CH_CHSR_Bits
{
    unsigned int TCOUNT:14;                 /**< \brief [13:0] Transfer Count Status (rh) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int LXO:1;                     /**< \brief [15:15] Old Value of Pattern Detection (rh) */
    unsigned int WRPS:1;                    /**< \brief [16:16] Wrap Source Buffer (rh) */
    unsigned int WRPD:1;                    /**< \brief [17:17] Wrap Destination Buffer (rh) */
    unsigned int ICH:1;                     /**< \brief [18:18] Interrupt from Channel (rh) */
    unsigned int IPM:1;                     /**< \brief [19:19] Pattern Detection from Channel (rh) */
    unsigned int TRL:1;                     /**< \brief [20:20] Transaction/Transfer Request Lost of DMA Channel (rh) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int CH:1;                      /**< \brief [24:24] Transaction Request State (rh) */
    unsigned int HTRE:1;                    /**< \brief [25:25] Hardware Transaction Request Enable State (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_CH_CHSR_Bits;

/** \\brief  SDMA Channel Destination Address Register */
typedef struct _Ifx_SDMA_BLK_CH_DADR_Bits
{
    unsigned int DADR:32;                   /**< \brief [31:0] Destination Address (rwh) */
} Ifx_SDMA_BLK_CH_DADR_Bits;

/** \\brief  SDMA Channel Source Address Register */
typedef struct _Ifx_SDMA_BLK_CH_SADR_Bits
{
    unsigned int SADR:32;                   /**< \brief [31:0] Source Start Address (rwh) */
} Ifx_SDMA_BLK_CH_SADR_Bits;

/** \\brief  SDMA Channel Shadow Address Register */
typedef struct _Ifx_SDMA_BLK_CH_SHADR_Bits
{
    unsigned int SHADR:32;                  /**< \brief [31:0] Shadowed Address (rwh) */
} Ifx_SDMA_BLK_CH_SHADR_Bits;

