HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_regdef.h
/** \\brief  SDMA Channel Interrupt Set Register0 */
typedef struct _Ifx_SDMA_BLK_CHINTR0_Bits
{
    unsigned int SIT0:1;                    /**< \brief [0:0] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int SIT1:1;                    /**< \brief [1:1] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int SIT2:1;                    /**< \brief [2:2] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int SIT3:1;                    /**< \brief [3:3] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int SIT4:1;                    /**< \brief [4:4] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int SIT5:1;                    /**< \brief [5:5] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int SIT6:1;                    /**< \brief [6:6] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int SIT7:1;                    /**< \brief [7:7] Set Interrupt Trigger for SDMA Channel z (w) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_CHINTR0_Bits;

/** \\brief  SDMA Channel Reset Request Register0 */
typedef struct _Ifx_SDMA_BLK_CHRSTR0_Bits
{
    unsigned int CH0:1;                     /**< \brief [0:0] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH1:1;                     /**< \brief [1:1] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH2:1;                     /**< \brief [2:2] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH3:1;                     /**< \brief [3:3] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH4:1;                     /**< \brief [4:4] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH5:1;                     /**< \brief [5:5] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH6:1;                     /**< \brief [6:6] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int CH7:1;                     /**< \brief [7:7] DMA Sub-block x Channel z Reset (rwh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_CHRSTR0_Bits;

/** \\brief  SDMA Clear Error Register */
typedef struct _Ifx_SDMA_BLK_CLRE_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int CMExSER:1;                 /**< \brief [16:16] Clear Move Engine x Source Error (w) */
    unsigned int CMExDER:1;                 /**< \brief [17:17] Clear Move Engine x Destination Error (w) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int CFPIER:1;                  /**< \brief [20:20] Clear FPI Error (w) */
    unsigned int CSRIER:1;                  /**< \brief [21:21] Clear SRI Error (w) */
    unsigned int CPERER:1;                  /**< \brief [22:22] Clear Peripheral Error (w) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_CLRE_Bits;

/** \\brief  SDMA Enable Error Register */
typedef struct _Ifx_SDMA_BLK_EER_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int ESER:1;                    /**< \brief [16:16] Enable Move Engine x Source Error (rw) */
    unsigned int EDER:1;                    /**< \brief [17:17] Enable Move Engine x Destination Error (rw) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_EER_Bits;

/** \\brief  SDMA Error Status Register */
typedef struct _Ifx_SDMA_BLK_ERRSR_Bits
{
    unsigned int LEC:6;                     /**< \brief [5:0] Move Engine x Last Error Channel (rh) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int SER:1;                     /**< \brief [16:16] Move Engine x Source Error (rh) */
    unsigned int DER:1;                     /**< \brief [17:17] Move Engine x Destination Error (rh) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int FPIER:1;                   /**< \brief [20:20] Move Engine x FPI Bus Error (rh) */
    unsigned int SRIER:1;                   /**< \brief [21:21] Move Engine x SRI Bus Error (rh) */
    unsigned int PERER:1;                   /**< \brief [22:22] Move Engine x Peripheral Error (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_ERRSR_Bits;

/** \\brief  SDMA Move Engine Interrupt Set Register */
typedef struct _Ifx_SDMA_BLK_ME_INTR_Bits
{
    unsigned int SIT:1;                     /**< \brief [0:0] Set Interrupt Trigger for SDMA Move Engine x (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_ME_INTR_Bits;

/** \\brief  SDMA Move Engine Pattern Read Register */
typedef struct _Ifx_SDMA_BLK_ME_PR_Bits
{
    unsigned int PAT00:8;                   /**< \brief [7:0] Pattern for Move Engine x (rw) */
    unsigned int PAT01:8;                   /**< \brief [15:8] Pattern for Move Engine x (rw) */
    unsigned int PAT02:8;                   /**< \brief [23:16] Pattern for Move Engine x (rw) */
    unsigned int PAT03:8;                   /**< \brief [31:24] Pattern for Move Engine x (rw) */
} Ifx_SDMA_BLK_ME_PR_Bits;

/** \\brief  SDMA Move Engine Read Register */
typedef struct _Ifx_SDMA_BLK_ME_R_Bits
{
    unsigned int RD00:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD01:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD02:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD03:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_SDMA_BLK_ME_R_Bits;

/** \\brief  SDMA Move Engine Status Register */
typedef struct _Ifx_SDMA_BLK_ME_SR_Bits
{
    unsigned int RS:1;                      /**< \brief [0:0] Move Engine x Read Status (rh) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int WS:1;                      /**< \brief [4:4] Move Engine x Write Status (rh) */
    unsigned int reserved_5:11;             /**< \brief \internal Reserved */
    unsigned int CH:6;                      /**< \brief [21:16] Reading Channel in Move Engine x (rh) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_ME_SR_Bits;

