HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_regdef.h
/** \\brief  SDMA Suspend Acknowledge Register0 */
typedef struct _Ifx_SDMA_BLK_SUSACR0_Bits
{
    unsigned int SUSAC0:1;                  /**< \brief [0:0] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC1:1;                  /**< \brief [1:1] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC2:1;                  /**< \brief [2:2] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC3:1;                  /**< \brief [3:3] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC4:1;                  /**< \brief [4:4] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC5:1;                  /**< \brief [5:5] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC6:1;                  /**< \brief [6:6] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int SUSAC7:1;                  /**< \brief [7:7] Channel Suspend Active for SDMA Channel z (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_SUSACR0_Bits;

/** \\brief  SDMA Suspend Enable Register0 */
typedef struct _Ifx_SDMA_BLK_SUSENR0_Bits
{
    unsigned int SUSEN0:1;                  /**< \brief [0:0] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int SUSEN1:1;                  /**< \brief [1:1] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int SUSEN2:1;                  /**< \brief [2:2] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int SUSEN3:1;                  /**< \brief [3:3] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int SUSEN4:1;                  /**< \brief [4:4] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int SUSEN5:1;                  /**< \brief [5:5] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int SUSEN6:1;                  /**< \brief [6:6] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int SUSEN7:1;                  /**< \brief [7:7] Channel Suspend Enable for SDMA Channel z (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SDMA_BLK_SUSENR0_Bits;

/** \\brief  SDMA Sub-block 0 Clock Control Register */
typedef struct _Ifx_SDMA_CLC0_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_SDMA_CLC0_Bits;

/** \\brief  SDMA Sub-block 1 Clock Control Register */
typedef struct _Ifx_SDMA_CLC1_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_SDMA_CLC1_Bits;

/** \\brief  SDMA Channel Read Data CRC Register */
typedef struct _Ifx_SDMA_CRCCH_RD_Bits
{
    unsigned int RDCRC:32;                  /**< \brief [31:0] Read Data CRC (rwh) */
} Ifx_SDMA_CRCCH_RD_Bits;

/** \\brief  SDMA Channel Source and Destination Address CRC Register */
typedef struct _Ifx_SDMA_CRCCH_SD_Bits
{
    unsigned int SDCRC:32;                  /**< \brief [31:0] Source and Destination Address CRC (rwh) */
} Ifx_SDMA_CRCCH_SD_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_SDMA_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_SDMA_ID_Bits;

/** \\brief  SDMA OCDS Trigger Set Select */
typedef struct _Ifx_SDMA_OTSS_Bits
{
    unsigned int TGS:4;                     /**< \brief [3:0] Trigger Set () for OTGB0/1 (rw) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int BS:1;                      /**< \brief [7:7] OTGB0/1 Bus Select (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SDMA_OTSS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sdma_union
 * \{  */

/** \\brief  SDMA Sub-block Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_ACCEN0_Bits B;
} Ifx_SDMA_BLK_ACCEN0;

/** \\brief  SDMA Sub-block Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_ACCEN1_Bits B;
} Ifx_SDMA_BLK_ACCEN1;

/** \\brief  SDMA Channel Address Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CH_ADRCR_Bits B;
} Ifx_SDMA_BLK_CH_ADRCR;

/** \\brief  SDMA Channel Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CH_CHCR_Bits B;
} Ifx_SDMA_BLK_CH_CHCR;

/** \\brief  SDMA Channel Interrupt Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CH_CHICR_Bits B;
} Ifx_SDMA_BLK_CH_CHICR;

/** \\brief  SDMA Channel Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CH_CHSR_Bits B;
} Ifx_SDMA_BLK_CH_CHSR;

/** \\brief  SDMA Channel Destination Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CH_DADR_Bits B;
} Ifx_SDMA_BLK_CH_DADR;

/** \\brief  SDMA Channel Source Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CH_SADR_Bits B;
} Ifx_SDMA_BLK_CH_SADR;

/** \\brief  SDMA Channel Shadow Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CH_SHADR_Bits B;
} Ifx_SDMA_BLK_CH_SHADR;

