HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_regdef.h
/** \\brief  SDMA Channel Interrupt Set Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CHINTR0_Bits B;
} Ifx_SDMA_BLK_CHINTR0;

/** \\brief  SDMA Channel Reset Request Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CHRSTR0_Bits B;
} Ifx_SDMA_BLK_CHRSTR0;

/** \\brief  SDMA Clear Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_CLRE_Bits B;
} Ifx_SDMA_BLK_CLRE;

/** \\brief  SDMA Enable Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_EER_Bits B;
} Ifx_SDMA_BLK_EER;

/** \\brief  SDMA Error Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_ERRSR_Bits B;
} Ifx_SDMA_BLK_ERRSR;

/** \\brief  SDMA Move Engine Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_ME_INTR_Bits B;
} Ifx_SDMA_BLK_ME_INTR;

/** \\brief  SDMA Move Engine Pattern Read Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_ME_PR_Bits B;
} Ifx_SDMA_BLK_ME_PR;

/** \\brief  SDMA Move Engine Read Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_ME_R_Bits B;
} Ifx_SDMA_BLK_ME_R;

/** \\brief  SDMA Move Engine Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_ME_SR_Bits B;
} Ifx_SDMA_BLK_ME_SR;

/** \\brief  SDMA Suspend Acknowledge Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_SUSACR0_Bits B;
} Ifx_SDMA_BLK_SUSACR0;

/** \\brief  SDMA Suspend Enable Register0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_BLK_SUSENR0_Bits B;
} Ifx_SDMA_BLK_SUSENR0;

/** \\brief  SDMA Sub-block 0 Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_CLC0_Bits B;
} Ifx_SDMA_CLC0;

/** \\brief  SDMA Sub-block 1 Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_CLC1_Bits B;
} Ifx_SDMA_CLC1;

/** \\brief  SDMA Channel Read Data CRC Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_CRCCH_RD_Bits B;
} Ifx_SDMA_CRCCH_RD;

/** \\brief  SDMA Channel Source and Destination Address CRC Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_CRCCH_SD_Bits B;
} Ifx_SDMA_CRCCH_SD;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_ID_Bits B;
} Ifx_SDMA_ID;

/** \\brief  SDMA OCDS Trigger Set Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SDMA_OTSS_Bits B;
} Ifx_SDMA_OTSS;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sdma_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \\brief  DMA channels */
typedef volatile struct _Ifx_SDMA_BLK_CH
{
    Ifx_SDMA_BLK_CH_CHSR CHSR;              /**< \brief 0, SDMA Channel Status Register */
    Ifx_SDMA_BLK_CH_CHCR CHCR;              /**< \brief 4, SDMA Channel Control Register */
    Ifx_SDMA_BLK_CH_CHICR CHICR;            /**< \brief 8, SDMA Channel Interrupt Control Register */
    Ifx_SDMA_BLK_CH_ADRCR ADRCR;            /**< \brief C, SDMA Channel Address Control Register */
    Ifx_SDMA_BLK_CH_SADR SADR;              /**< \brief 10, SDMA Channel Source Address Register */
    Ifx_SDMA_BLK_CH_DADR DADR;              /**< \brief 14, SDMA Channel Destination Address Register */
    Ifx_SDMA_BLK_CH_SHADR SHADR;            /**< \brief 18, SDMA Channel Shadow Address Register */
    unsigned char reserved_1C[4];           /**< \brief 1C, \internal Reserved */
} Ifx_SDMA_BLK_CH;

/** \\brief  DMA move engine */
typedef volatile struct _Ifx_SDMA_BLK_ME
{
    Ifx_SDMA_BLK_ME_SR SR;                  /**< \brief 0, SDMA Move Engine Status Register */
    Ifx_SDMA_BLK_ME_R R;                    /**< \brief 4, SDMA Move Engine Read Register */
    Ifx_SDMA_BLK_ME_INTR INTR;              /**< \brief 8, SDMA Move Engine Interrupt Set Register */
    Ifx_SDMA_BLK_ME_PR PR;                  /**< \brief C, SDMA Move Engine Pattern Read Register */
} Ifx_SDMA_BLK_ME;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sdma_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

