HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_regdef.h
/** \\brief  SDMA sub block */
typedef volatile struct _Ifx_SDMA_BLK
{
    Ifx_SDMA_BLK_EER EER;                   /**< \brief 0, SDMA Enable Error Register */
    Ifx_SDMA_BLK_ERRSR ERRSR;               /**< \brief 4, SDMA Error Status Register */
    Ifx_SDMA_BLK_CLRE CLRE;                 /**< \brief 8, SDMA Clear Error Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_SDMA_BLK_ME ME;                     /**< \brief 10, DMA move engine */
    Ifx_SDMA_BLK_CHRSTR0 CHRSTR0;           /**< \brief 20, SDMA Channel Reset Request Register0 */
    unsigned char reserved_24[28];          /**< \brief 24, \internal Reserved */
    Ifx_SDMA_BLK_SUSENR0 SUSENR0;           /**< \brief 40, SDMA Suspend Enable Register0 */
    unsigned char reserved_44[4];           /**< \brief 44, \internal Reserved */
    Ifx_SDMA_BLK_SUSACR0 SUSACR0;           /**< \brief 48, SDMA Suspend Acknowledge Register0 */
    unsigned char reserved_4C[4];           /**< \brief 4C, \internal Reserved */
    Ifx_SDMA_BLK_CHINTR0 CHINTR0;           /**< \brief 50, SDMA Channel Interrupt Set Register0 */
    unsigned char reserved_54[12];          /**< \brief 54, \internal Reserved */
    Ifx_SDMA_BLK_CH CH[8];                  /**< \brief 60, DMA channels */
    unsigned char reserved_160[1912];       /**< \brief 160, \internal Reserved */
    Ifx_SDMA_BLK_ACCEN1 ACCEN1;             /**< \brief 8D8, SDMA Sub-block Access Enable Register 1 */
    Ifx_SDMA_BLK_ACCEN0 ACCEN0;             /**< \brief 8DC, SDMA Sub-block Access Enable Register 0 */
} Ifx_SDMA_BLK;

/** \\brief  CRC Channels */
typedef volatile struct _Ifx_SDMA_CRCCH
{
    Ifx_SDMA_CRCCH_RD RD;                   /**< \brief 0, SDMA Channel Read Data CRC Register */
    Ifx_SDMA_CRCCH_SD SD;                   /**< \brief 4, SDMA Channel Source and Destination Address CRC Register */
    unsigned char reserved_8[24];           /**< \brief 8, \internal Reserved */
} Ifx_SDMA_CRCCH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sdma_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  SDMA object */
typedef volatile struct _Ifx_SDMA
{
    Ifx_SDMA_CLC0 CLC0;                     /**< \brief 0, SDMA Sub-block 0 Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_SDMA_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_SDMA_OTSS OTSS;                     /**< \brief C, SDMA OCDS Trigger Set Select */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
    Ifx_SDMA_BLK BLK0;                      /**< \brief 20, SDMA sub block 0 */
    unsigned char reserved_900[1792];       /**< \brief 900, \internal Reserved */
    Ifx_SDMA_CLC1 CLC1;                     /**< \brief 1000, SDMA Sub-block 1 Clock Control Register */
    unsigned char reserved_1004[28];        /**< \brief 1004, \internal Reserved */
    Ifx_SDMA_BLK BLK1;                      /**< \brief 1020, SDMA sub block 1 */
    unsigned char reserved_1900[1816];      /**< \brief 1900, \internal Reserved */
    Ifx_SDMA_CRCCH CRCCH0[8];               /**< \brief 2018, CRC Channels */
    unsigned char reserved_2118[1792];      /**< \brief 2118, \internal Reserved */
    Ifx_SDMA_CRCCH CRCCH1[8];               /**< \brief 2818, CRC Channels */
    unsigned char reserved_2918[1768];      /**< \brief 2918, \internal Reserved */
} Ifx_SDMA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSDMA_REGDEF_H */
